{"keras_version": "2.0.5", "config": [{"config": {"batch_input_shape": [null, 2000], "dtype": "int32", "input_dim": 5155, "name": "embedding_1", "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "output_dim": 300, "activity_regularizer": null, "mask_zero": true, "embeddings_regularizer": null, "trainable": true, "input_length": 2000}, "class_name": "Embedding"}, {"config": {"kernel_constraint": null, "filters": 3, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv1d_with_masking_1", "kernel_regularizer": null, "padding": "same", "activity_regularizer": null, "dilation_rate": [1], "kernel_size": [3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "strides": [1], "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv1DWithMasking"}, {"config": {"units": 3, "bias_constraint": null, "unroll": false, "name": "lstm_1", "recurrent_regularizer": null, "go_backwards": false, "activity_regularizer": null, "return_state": false, "dropout": 0.0, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "use_bias": true, "kernel_constraint": null, "return_sequences": true, "trainable": true, "recurrent_activation": "hard_sigmoid", "stateful": false, "kernel_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.1, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "attention_1", "trainable": true, "init_stdev": 0.01, "activation": "tanh", "op": "attmean"}, "class_name": "Attention"}, {"config": {"kernel_constraint": null, "units": 1, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}], "backend": "theano", "class_name": "Sequential"}